## Plan Result (prod_enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 66 to add, 3 to change, 63 to destroy.</code></pre>

* Create
  * module.custom_role_assignments[&#34;CRIME-ADO-POC&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-CFT-Sandbox&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-CNP-DEV&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-CNP-QA&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-MI-SBOX&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-RDO-Development&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-RDO-Production&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-DATAINGEST-PROD&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-DATAINGEST-SBOX&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-DATAINGEST-STG&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-HERITAGE-INTSVC-DEV&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;HMCTS-HUB-DEV&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;HMCTS-HUB-SBOX&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;HMCTS-HUB-TEST&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;HMCTS-SOC-PROD&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;HMCTS-SOC-SBOX&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;MoJ Common Platform Operational Services&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;Reform-CFT-Mgmt&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;Reform-CFT-VH-Dev&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
* Update
  * module.enterprise.azurerm_management_group.level_3[&#34;Heritage-NonProd&#34;]
  * module.enterprise.azurerm_management_group.level_3[&#34;Heritage-Prod&#34;]
  * module.enterprise.azurerm_management_group.level_3[&#34;Heritage-Sandbox&#34;]
* Delete
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.custom_role_assignments["CRIME-ADO-POC"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6b2c4a37-044e-4f83-9bd6-c8181f81f4dd"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/ef8dd153-3fba-47a4-be65-15775bcde240/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/ef8dd153-3fba-47a4-be65-15775bcde240"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-AWS-Migration"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ff5ea8a7-a509-4f4a-ad85-9e27d5aa81e1"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/58a2ce36-4e09-467b-8330-d164aa559c68/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/58a2ce36-4e09-467b-8330-d164aa559c68"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-CFT-Sandbox"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2e6ff9f6-d09c-4033-b374-24c04660487e"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-CFT-VH-Pilot"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6c12b0ed-9996-47f3-8902-0c9046fac4b4"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/4bb049c8-33f3-4860-91b4-9ee45375cc18/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/4bb049c8-33f3-4860-91b4-9ee45375cc18"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-CFTAPPS-DEMO"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e0c910b7-cab0-4066-8299-0754a3ca6a17"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-CFTAPPS-DEV"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d5e3ba53-7eef-495b-8e95-abce4056f40a"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-CFTAPPS-ITHC"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ac2dc06b-61e8-4ebe-ac14-c680724944f3"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-CFTAPPS-PROD"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "44c2562a-c42f-44ad-baed-6d756e552421"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-CFTAPPS-SBOX"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "13b7591b-6a22-41f7-aeb4-89926785c0ce"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-CFTAPPS-STG"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "890ccf59-f9e5-4758-a392-2c03e4fdaeb5"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-CFTAPPS-TEST"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "02ea7c69-56e5-4e48-83eb-5cc721dfb432"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-CFTAPPSDATA-DEMO"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6cdfafb8-0cc7-4f85-8758-c055da3ae2ec"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/dbd3a97b-580e-4ecb-9ed3-4e86f6f23d25/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/dbd3a97b-580e-4ecb-9ed3-4e86f6f23d25"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-CNP-DEV"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "847b4c4a-6bdf-4e35-b8f3-dc6a81b89d57"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-CNP-Prod"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cfd53954-7782-4aae-b100-8108eb8f6094"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-CNP-QA"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "279ff279-b495-48da-ad6d-e43d9ba38191"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-MI-SBOX"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7e128cf2-6ab5-488b-8128-634ed5ac4c18"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/0c1744f8-9e63-4742-9c28-c066fd2e6eee/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/0c1744f8-9e63-4742-9c28-c066fd2e6eee"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-RDO-Development"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "29624f48-a0ac-42cc-b7d4-3551d987adb9"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/fa397675-6ddf-4cb0-b1fc-bc7df0e51bf4/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/fa397675-6ddf-4cb0-b1fc-bc7df0e51bf4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-RDO-Production"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a8417a04-42fb-4019-8976-094376df09f4"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/00b9a00a-20eb-4173-b7b6-468e00836a33/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/00b9a00a-20eb-4173-b7b6-468e00836a33"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-ROBOTICS-DEV"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "486a3048-3e66-4b76-8371-b7d0d2b3f1ab"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/6fe2c66c-ef6f-4064-9ced-95ac3fb8966f/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/6fe2c66c-ef6f-4064-9ced-95ac3fb8966f"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DCD-ROBOTICS-SBOX"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e36533dc-2be3-420a-9a5f-882560063019"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/cdc31e8e-43f4-4c8a-8b50-635e954c27d3/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/cdc31e8e-43f4-4c8a-8b50-635e954c27d3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DTS-ARCHIVING-PROD"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3d15a4dc-9f5b-45f5-ac72-ad9d391d5bda"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/61432c17-4377-4780-be02-d56e56ef2b07/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/61432c17-4377-4780-be02-d56e56ef2b07"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DTS-ARCHIVING-TEST"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b40cd6f9-4d97-4b07-a6d7-fab86c92c0d4"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/cad00ede-36df-4e04-ad0b-d34a1e94ef76/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af"
      + role_definition_name             = (known after apply)
      + scope            

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

        = "1dc25ae0-82cc-a0df-1d35-23a9849f5604" -> null
      - principal_id         = "d1240eb4-a2c4-43cf-8bb7-062cf7dd8b6e" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263" -> null
    }

  # module.subscription["HMCTS-HUB-DEV"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/b50cfb90-d6cd-4e78-97e6-cb7958335b6e/providers/Microsoft.Authorization/roleAssignments/07b7759c-df40-f622-c2c2-4dcbb3e339a0" -> null
      - name                 = "07b7759c-df40-f622-c2c2-4dcbb3e339a0" -> null
      - principal_id         = "fd63b66f-6c40-4b4f-9aef-bc2f79097fcb" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/b50cfb90-d6cd-4e78-97e6-cb7958335b6e/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/b50cfb90-d6cd-4e78-97e6-cb7958335b6e" -> null
    }

  # module.subscription["HMCTS-HUB-NONPROD-INTSVC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/providers/Microsoft.Authorization/roleAssignments/5f50f740-56c2-2a2e-8532-4a19a2595e82" -> null
      - name                 = "5f50f740-56c2-2a2e-8532-4a19a2595e82" -> null
      - principal_id         = "44014b51-3065-41ec-8d34-84e0ab6cff39" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c" -> null
    }

  # module.subscription["HMCTS-HUB-PROD-INTSVC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/providers/Microsoft.Authorization/roleAssignments/ba51b015-fcc6-cedb-7783-7ea5ade0f290" -> null
      - name                 = "ba51b015-fcc6-cedb-7783-7ea5ade0f290" -> null
      - principal_id         = "e9c76820-cfbb-4b26-8774-65207690fa90" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214" -> null
    }

  # module.subscription["HMCTS-HUB-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d/providers/Microsoft.Authorization/roleAssignments/29e723d5-b772-2864-5e3d-c26f2833bd9e" -> null
      - name                 = "29e723d5-b772-2864-5e3d-c26f2833bd9e" -> null
      - principal_id         = "1b69b064-2389-411c-a345-6983ce824f7e" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d" -> null
    }

  # module.subscription["HMCTS-HUB-SBOX-INTSVC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/providers/Microsoft.Authorization/roleAssignments/7cdb532d-7083-d075-7f08-fbb9f2b177a5" -> null
      - name                 = "7cdb532d-7083-d075-7f08-fbb9f2b177a5" -> null
      - principal_id         = "f2c0b687-874e-4d8f-908d-deb31e3db115" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c" -> null
    }

  # module.subscription["HMCTS-HUB-TEST"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/ba3c6fcf-22b1-4a11-9080-1cf965c060e9/providers/Microsoft.Authorization/roleAssignments/065a7052-0475-03d9-4897-9dbc8568f248" -> null
      - name                 = "065a7052-0475-03d9-4897-9dbc8568f248" -> null
      - principal_id         = "5b1b97bc-c5dd-4b1d-932e-24621fd059ea" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ba3c6fcf-22b1-4a11-9080-1cf965c060e9/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/ba3c6fcf-22b1-4a11-9080-1cf965c060e9" -> null
    }

  # module.subscription["HMCTS-SOC-PROD"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/8ae5b3b6-0b12-4888-b894-4cec33c92292/providers/Microsoft.Authorization/roleAssignments/e3c3b259-1e07-92ca-9250-0688912a6333" -> null
      - name                 = "e3c3b259-1e07-92ca-9250-0688912a6333" -> null
      - principal_id         = "1285d7a4-9cbf-4a05-a15c-4c08acc69370" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/8ae5b3b6-0b12-4888-b894-4cec33c92292/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/8ae5b3b6-0b12-4888-b894-4cec33c92292" -> null
    }

  # module.subscription["HMCTS-SOC-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2/providers/Microsoft.Authorization/roleAssignments/9424b9e5-9765-eb5e-f201-a3934ae64e31" -> null
      - name                 = "9424b9e5-9765-eb5e-f201-a3934ae64e31" -> null
      - principal_id         = "3c2e1915-f50e-41d2-b10d-8c5202958af1" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2" -> null
    }

  # module.subscription["MOJ DCD Atlassian LVE"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/providers/Microsoft.Authorization/roleAssignments/9531b879-c41a-6f20-b505-52e635a929c0" -> null
      - name                 = "9531b879-c41a-6f20-b505-52e635a929c0" -> null
      - principal_id         = "4534cad8-da3b-4e04-abfb-f0823f029a8c" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95" -> null
    }

  # module.subscription["MOJ DCD Atlassian NLE"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/providers/Microsoft.Authorization/roleAssignments/5a0b6d2d-6cb8-c7bc-8dc0-be58a239b86b" -> null
      - name                 = "5a0b6d2d-6cb8-c7bc-8dc0-be58a239b86b" -> null
      - principal_id         = "fa93be0b-143a-4b32-bddc-81cd2c4499bc" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8" -> null
    }

  # module.subscription["MoJ Common Platform Non-Live Management"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/66cfcc0b-d764-4c07-bbeb-0a74101dbcf3/providers/Microsoft.Authorization/roleAssignments/3714e8d9-a2c0-9bf2-0d80-f651ddc2f020" -> null
      - name                 = "3714e8d9-a2c0-9bf2-0d80-f651ddc2f020" -> null
      - principal_id         = "9d69b84d-5fdb-4bdb-8c9b-e88f8b3e5424" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/66cfcc0b-d764-4c07-bbeb-0a74101dbcf3/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/66cfcc0b-d764-4c07-bbeb-0a74101dbcf3" -> null
    }

  # module.subscription["MoJ Common Platform Operational Services"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/28d33a47-7c14-456d-9a40-ce9c9b5a3937/providers/Microsoft.Authorization/roleAssignments/3fe40bb1-17f2-2651-ae47-9cd69863e866" -> null
      - name                 = "3fe40bb1-17f2-2651-ae47-9cd69863e866" -> null
      - principal_id         = "594cb070-a962-4c65-ae1c-00d5a274bf5a" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/28d33a47-7c14-456d-9a40-ce9c9b5a3937/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/28d33a47-7c14-456d-9a40-ce9c9b5a3937" -> null
    }

  # module.subscription["MoJ Common Platform Pre-Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/3d84f717-22a0-4f4e-aac7-5ff8f4ee0a90/providers/Microsoft.Authorization/roleAssignments/84bed9a3-3155-2eb4-0b30-bd48cc8fc24e" -> null
      - name                 = "84bed9a3-3155-2eb4-0b30-bd48cc8fc24e" -> null
      - principal_id         = "6116bec5-6a87-469a-ac94-67e83603d036" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/3d84f717-22a0-4f4e-aac7-5ff8f4ee0a90/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/3d84f717-22a0-4f4e-aac7-5ff8f4ee0a90" -> null
    }

  # module.subscription["MoJ Common Platform Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/55c2f45e-1381-4b17-9bd0-f85215b8bb4f/providers/Microsoft.Authorization/roleAssignments/963dfe85-8579-8160-37db-54ff7226a72d" -> null
      - name                 = "963dfe85-8579-8160-37db-54ff7226a72d" -> null
      - principal_id         = "2b9fcb05-20ac-4ba4-a323-f56bbfc9e303" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/55c2f45e-1381-4b17-9bd0-f85215b8bb4f/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/55c2f45e-1381-4b17-9bd0-f85215b8bb4f" -> null
    }

  # module.subscription["MoJ Operational Services Validation"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/6491a35d-b1cc-4823-8340-0b847abc9a1b/providers/Microsoft.Authorization/roleAssignments/6ea005b6-50d7-8470-4f08-e2dd8fec467b" -> null
      - name                 = "6ea005b6-50d7-8470-4f08-e2dd8fec467b" -> null
      - principal_id         = "e76fe869-ce2f-46db-bd9d-f79bce5b7673" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/6491a35d-b1cc-4823-8340-0b847abc9a1b/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/6491a35d-b1cc-4823-8340-0b847abc9a1b" -> null
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce/providers/Microsoft.Authorization/roleAssignments/7f339ed4-726c-79c5-57da-de8f741e897e" -> null
      - name                 = "7f339ed4-726c-79c5-57da-de8f741e897e" -> null
      - principal_id         = "5cfbc1e7-241a-4729-9b16-089360ab3f54" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce" -> null
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleAssignments/cd40ca00-e77c-8750-0914-60aa03e45a70" -> null
      - name                 = "cd40ca00-e77c-8750-0914-60aa03e45a70" -> null
      - principal_id         = "0a3a9204-8f79-403f-9917-5a19bc3ea045" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e" -> null
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347/providers/Microsoft.Authorization/roleAssignments/3579f7d0-f74f-05ee-32cb-d07299d7c3b4" -> null
      - name                 = "3579f7d0-f74f-05ee-32cb-d07299d7c3b4" -> null
      - principal_id         = "94d21afe-5d3d-41a9-8262-067241c81d9d" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347" -> null
    }

Plan: 66 to add, 3 to change, 63 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":96,"Program":"tfcmt","SHA1":"","Target":"prod_enterprise","Vars":{}} -->